; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p3---int100n150-m25---int100c150---s53---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level3 level3)
(sum level0 level8 level8)
(sum level0 level10 level10)
(sum level0 level15 level15)
(sum level0 level17 level17)
(sum level0 level19 level19)
(sum level0 level23 level23)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level3 level4)
(sum level1 level8 level9)
(sum level1 level10 level11)
(sum level1 level15 level16)
(sum level1 level17 level18)
(sum level1 level19 level20)
(sum level1 level23 level24)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level3 level5)
(sum level2 level8 level10)
(sum level2 level10 level12)
(sum level2 level15 level17)
(sum level2 level17 level19)
(sum level2 level19 level21)
(sum level2 level23 level25)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level3 level6)
(sum level3 level8 level11)
(sum level3 level10 level13)
(sum level3 level15 level18)
(sum level3 level17 level20)
(sum level3 level19 level22)
(sum level3 level23 level26)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level3 level7)
(sum level4 level8 level12)
(sum level4 level10 level14)
(sum level4 level15 level19)
(sum level4 level17 level21)
(sum level4 level19 level23)
(sum level4 level23 level27)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level3 level8)
(sum level5 level8 level13)
(sum level5 level10 level15)
(sum level5 level15 level20)
(sum level5 level17 level22)
(sum level5 level19 level24)
(sum level5 level23 level28)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level3 level9)
(sum level6 level8 level14)
(sum level6 level10 level16)
(sum level6 level15 level21)
(sum level6 level17 level23)
(sum level6 level19 level25)
(sum level6 level23 level29)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level3 level10)
(sum level7 level8 level15)
(sum level7 level10 level17)
(sum level7 level15 level22)
(sum level7 level17 level24)
(sum level7 level19 level26)
(sum level7 level23 level30)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level3 level11)
(sum level8 level8 level16)
(sum level8 level10 level18)
(sum level8 level15 level23)
(sum level8 level17 level25)
(sum level8 level19 level27)
(sum level8 level23 level31)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level3 level12)
(sum level9 level8 level17)
(sum level9 level10 level19)
(sum level9 level15 level24)
(sum level9 level17 level26)
(sum level9 level19 level28)
(sum level9 level23 level32)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level3 level13)
(sum level10 level8 level18)
(sum level10 level10 level20)
(sum level10 level15 level25)
(sum level10 level17 level27)
(sum level10 level19 level29)
(sum level10 level23 level33)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level3 level14)
(sum level11 level8 level19)
(sum level11 level10 level21)
(sum level11 level15 level26)
(sum level11 level17 level28)
(sum level11 level19 level30)
(sum level11 level23 level34)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level3 level15)
(sum level12 level8 level20)
(sum level12 level10 level22)
(sum level12 level15 level27)
(sum level12 level17 level29)
(sum level12 level19 level31)
(sum level12 level23 level35)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level3 level16)
(sum level13 level8 level21)
(sum level13 level10 level23)
(sum level13 level15 level28)
(sum level13 level17 level30)
(sum level13 level19 level32)
(sum level13 level23 level36)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level3 level17)
(sum level14 level8 level22)
(sum level14 level10 level24)
(sum level14 level15 level29)
(sum level14 level17 level31)
(sum level14 level19 level33)
(sum level14 level23 level37)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level3 level18)
(sum level15 level8 level23)
(sum level15 level10 level25)
(sum level15 level15 level30)
(sum level15 level17 level32)
(sum level15 level19 level34)
(sum level15 level23 level38)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level3 level19)
(sum level16 level8 level24)
(sum level16 level10 level26)
(sum level16 level15 level31)
(sum level16 level17 level33)
(sum level16 level19 level35)
(sum level16 level23 level39)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level3 level20)
(sum level17 level8 level25)
(sum level17 level10 level27)
(sum level17 level15 level32)
(sum level17 level17 level34)
(sum level17 level19 level36)
(sum level17 level23 level40)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level3 level21)
(sum level18 level8 level26)
(sum level18 level10 level28)
(sum level18 level15 level33)
(sum level18 level17 level35)
(sum level18 level19 level37)
(sum level18 level23 level41)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level3 level22)
(sum level19 level8 level27)
(sum level19 level10 level29)
(sum level19 level15 level34)
(sum level19 level17 level36)
(sum level19 level19 level38)
(sum level19 level23 level42)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level3 level23)
(sum level20 level8 level28)
(sum level20 level10 level30)
(sum level20 level15 level35)
(sum level20 level17 level37)
(sum level20 level19 level39)
(sum level20 level23 level43)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level3 level24)
(sum level21 level8 level29)
(sum level21 level10 level31)
(sum level21 level15 level36)
(sum level21 level17 level38)
(sum level21 level19 level40)
(sum level21 level23 level44)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level3 level25)
(sum level22 level8 level30)
(sum level22 level10 level32)
(sum level22 level15 level37)
(sum level22 level17 level39)
(sum level22 level19 level41)
(sum level22 level23 level45)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level3 level26)
(sum level23 level8 level31)
(sum level23 level10 level33)
(sum level23 level15 level38)
(sum level23 level17 level40)
(sum level23 level19 level42)
(sum level23 level23 level46)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level3 level27)
(sum level24 level8 level32)
(sum level24 level10 level34)
(sum level24 level15 level39)
(sum level24 level17 level41)
(sum level24 level19 level43)
(sum level24 level23 level47)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level3 level28)
(sum level25 level8 level33)
(sum level25 level10 level35)
(sum level25 level15 level40)
(sum level25 level17 level42)
(sum level25 level19 level44)
(sum level25 level23 level48)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level3 level29)
(sum level26 level8 level34)
(sum level26 level10 level36)
(sum level26 level15 level41)
(sum level26 level17 level43)
(sum level26 level19 level45)
(sum level26 level23 level49)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level3 level30)
(sum level27 level8 level35)
(sum level27 level10 level37)
(sum level27 level15 level42)
(sum level27 level17 level44)
(sum level27 level19 level46)
(sum level27 level23 level50)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level3 level31)
(sum level28 level8 level36)
(sum level28 level10 level38)
(sum level28 level15 level43)
(sum level28 level17 level45)
(sum level28 level19 level47)
(sum level28 level23 level51)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level3 level32)
(sum level29 level8 level37)
(sum level29 level10 level39)
(sum level29 level15 level44)
(sum level29 level17 level46)
(sum level29 level19 level48)
(sum level29 level23 level52)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level3 level33)
(sum level30 level8 level38)
(sum level30 level10 level40)
(sum level30 level15 level45)
(sum level30 level17 level47)
(sum level30 level19 level49)
(sum level30 level23 level53)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level3 level34)
(sum level31 level8 level39)
(sum level31 level10 level41)
(sum level31 level15 level46)
(sum level31 level17 level48)
(sum level31 level19 level50)
(sum level31 level23 level54)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level3 level35)
(sum level32 level8 level40)
(sum level32 level10 level42)
(sum level32 level15 level47)
(sum level32 level17 level49)
(sum level32 level19 level51)
(sum level32 level23 level55)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level3 level36)
(sum level33 level8 level41)
(sum level33 level10 level43)
(sum level33 level15 level48)
(sum level33 level17 level50)
(sum level33 level19 level52)
(sum level33 level23 level56)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level3 level37)
(sum level34 level8 level42)
(sum level34 level10 level44)
(sum level34 level15 level49)
(sum level34 level17 level51)
(sum level34 level19 level53)
(sum level34 level23 level57)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level3 level38)
(sum level35 level8 level43)
(sum level35 level10 level45)
(sum level35 level15 level50)
(sum level35 level17 level52)
(sum level35 level19 level54)
(sum level35 level23 level58)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level3 level39)
(sum level36 level8 level44)
(sum level36 level10 level46)
(sum level36 level15 level51)
(sum level36 level17 level53)
(sum level36 level19 level55)
(sum level36 level23 level59)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level3 level40)
(sum level37 level8 level45)
(sum level37 level10 level47)
(sum level37 level15 level52)
(sum level37 level17 level54)
(sum level37 level19 level56)
(sum level37 level23 level60)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level3 level41)
(sum level38 level8 level46)
(sum level38 level10 level48)
(sum level38 level15 level53)
(sum level38 level17 level55)
(sum level38 level19 level57)
(sum level38 level23 level61)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level3 level42)
(sum level39 level8 level47)
(sum level39 level10 level49)
(sum level39 level15 level54)
(sum level39 level17 level56)
(sum level39 level19 level58)
(sum level39 level23 level62)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level3 level43)
(sum level40 level8 level48)
(sum level40 level10 level50)
(sum level40 level15 level55)
(sum level40 level17 level57)
(sum level40 level19 level59)
(sum level40 level23 level63)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level3 level44)
(sum level41 level8 level49)
(sum level41 level10 level51)
(sum level41 level15 level56)
(sum level41 level17 level58)
(sum level41 level19 level60)
(sum level41 level23 level64)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level3 level45)
(sum level42 level8 level50)
(sum level42 level10 level52)
(sum level42 level15 level57)
(sum level42 level17 level59)
(sum level42 level19 level61)
(sum level42 level23 level65)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level3 level46)
(sum level43 level8 level51)
(sum level43 level10 level53)
(sum level43 level15 level58)
(sum level43 level17 level60)
(sum level43 level19 level62)
(sum level43 level23 level66)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level3 level47)
(sum level44 level8 level52)
(sum level44 level10 level54)
(sum level44 level15 level59)
(sum level44 level17 level61)
(sum level44 level19 level63)
(sum level44 level23 level67)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level3 level48)
(sum level45 level8 level53)
(sum level45 level10 level55)
(sum level45 level15 level60)
(sum level45 level17 level62)
(sum level45 level19 level64)
(sum level45 level23 level68)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level3 level49)
(sum level46 level8 level54)
(sum level46 level10 level56)
(sum level46 level15 level61)
(sum level46 level17 level63)
(sum level46 level19 level65)
(sum level46 level23 level69)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level3 level50)
(sum level47 level8 level55)
(sum level47 level10 level57)
(sum level47 level15 level62)
(sum level47 level17 level64)
(sum level47 level19 level66)
(sum level47 level23 level70)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level3 level51)
(sum level48 level8 level56)
(sum level48 level10 level58)
(sum level48 level15 level63)
(sum level48 level17 level65)
(sum level48 level19 level67)
(sum level48 level23 level71)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level3 level52)
(sum level49 level8 level57)
(sum level49 level10 level59)
(sum level49 level15 level64)
(sum level49 level17 level66)
(sum level49 level19 level68)
(sum level49 level23 level72)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level3 level53)
(sum level50 level8 level58)
(sum level50 level10 level60)
(sum level50 level15 level65)
(sum level50 level17 level67)
(sum level50 level19 level69)
(sum level50 level23 level73)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level3 level54)
(sum level51 level8 level59)
(sum level51 level10 level61)
(sum level51 level15 level66)
(sum level51 level17 level68)
(sum level51 level19 level70)
(sum level51 level23 level74)
(sum level51 level25 level76)
(sum level52 level1 level53)
(sum level52 level3 level55)
(sum level52 level8 level60)
(sum level52 level10 level62)
(sum level52 level15 level67)
(sum level52 level17 level69)
(sum level52 level19 level71)
(sum level52 level23 level75)
(sum level52 level25 level77)
(sum level53 level1 level54)
(sum level53 level3 level56)
(sum level53 level8 level61)
(sum level53 level10 level63)
(sum level53 level15 level68)
(sum level53 level17 level70)
(sum level53 level19 level72)
(sum level53 level23 level76)
(sum level53 level25 level78)
(sum level54 level1 level55)
(sum level54 level3 level57)
(sum level54 level8 level62)
(sum level54 level10 level64)
(sum level54 level15 level69)
(sum level54 level17 level71)
(sum level54 level19 level73)
(sum level54 level23 level77)
(sum level54 level25 level79)
(sum level55 level1 level56)
(sum level55 level3 level58)
(sum level55 level8 level63)
(sum level55 level10 level65)
(sum level55 level15 level70)
(sum level55 level17 level72)
(sum level55 level19 level74)
(sum level55 level23 level78)
(sum level55 level25 level80)
(sum level56 level1 level57)
(sum level56 level3 level59)
(sum level56 level8 level64)
(sum level56 level10 level66)
(sum level56 level15 level71)
(sum level56 level17 level73)
(sum level56 level19 level75)
(sum level56 level23 level79)
(sum level56 level25 level81)
(sum level57 level1 level58)
(sum level57 level3 level60)
(sum level57 level8 level65)
(sum level57 level10 level67)
(sum level57 level15 level72)
(sum level57 level17 level74)
(sum level57 level19 level76)
(sum level57 level23 level80)
(sum level57 level25 level82)
(sum level58 level1 level59)
(sum level58 level3 level61)
(sum level58 level8 level66)
(sum level58 level10 level68)
(sum level58 level15 level73)
(sum level58 level17 level75)
(sum level58 level19 level77)
(sum level58 level23 level81)
(sum level58 level25 level83)
(sum level59 level1 level60)
(sum level59 level3 level62)
(sum level59 level8 level67)
(sum level59 level10 level69)
(sum level59 level15 level74)
(sum level59 level17 level76)
(sum level59 level19 level78)
(sum level59 level23 level82)
(sum level59 level25 level84)
(sum level60 level1 level61)
(sum level60 level3 level63)
(sum level60 level8 level68)
(sum level60 level10 level70)
(sum level60 level15 level75)
(sum level60 level17 level77)
(sum level60 level19 level79)
(sum level60 level23 level83)
(sum level60 level25 level85)
(sum level61 level1 level62)
(sum level61 level3 level64)
(sum level61 level8 level69)
(sum level61 level10 level71)
(sum level61 level15 level76)
(sum level61 level17 level78)
(sum level61 level19 level80)
(sum level61 level23 level84)
(sum level61 level25 level86)
(sum level62 level1 level63)
(sum level62 level3 level65)
(sum level62 level8 level70)
(sum level62 level10 level72)
(sum level62 level15 level77)
(sum level62 level17 level79)
(sum level62 level19 level81)
(sum level62 level23 level85)
(sum level62 level25 level87)
(sum level63 level1 level64)
(sum level63 level3 level66)
(sum level63 level8 level71)
(sum level63 level10 level73)
(sum level63 level15 level78)
(sum level63 level17 level80)
(sum level63 level19 level82)
(sum level63 level23 level86)
(sum level63 level25 level88)
(sum level64 level1 level65)
(sum level64 level3 level67)
(sum level64 level8 level72)
(sum level64 level10 level74)
(sum level64 level15 level79)
(sum level64 level17 level81)
(sum level64 level19 level83)
(sum level64 level23 level87)
(sum level64 level25 level89)
(sum level65 level1 level66)
(sum level65 level3 level68)
(sum level65 level8 level73)
(sum level65 level10 level75)
(sum level65 level15 level80)
(sum level65 level17 level82)
(sum level65 level19 level84)
(sum level65 level23 level88)
(sum level65 level25 level90)
(sum level66 level1 level67)
(sum level66 level3 level69)
(sum level66 level8 level74)
(sum level66 level10 level76)
(sum level66 level15 level81)
(sum level66 level17 level83)
(sum level66 level19 level85)
(sum level66 level23 level89)
(sum level66 level25 level91)
(sum level67 level1 level68)
(sum level67 level3 level70)
(sum level67 level8 level75)
(sum level67 level10 level77)
(sum level67 level15 level82)
(sum level67 level17 level84)
(sum level67 level19 level86)
(sum level67 level23 level90)
(sum level67 level25 level92)
(sum level68 level1 level69)
(sum level68 level3 level71)
(sum level68 level8 level76)
(sum level68 level10 level78)
(sum level68 level15 level83)
(sum level68 level17 level85)
(sum level68 level19 level87)
(sum level68 level23 level91)
(sum level68 level25 level93)
(sum level69 level1 level70)
(sum level69 level3 level72)
(sum level69 level8 level77)
(sum level69 level10 level79)
(sum level69 level15 level84)
(sum level69 level17 level86)
(sum level69 level19 level88)
(sum level69 level23 level92)
(sum level69 level25 level94)
(sum level70 level1 level71)
(sum level70 level3 level73)
(sum level70 level8 level78)
(sum level70 level10 level80)
(sum level70 level15 level85)
(sum level70 level17 level87)
(sum level70 level19 level89)
(sum level70 level23 level93)
(sum level70 level25 level95)
(sum level71 level1 level72)
(sum level71 level3 level74)
(sum level71 level8 level79)
(sum level71 level10 level81)
(sum level71 level15 level86)
(sum level71 level17 level88)
(sum level71 level19 level90)
(sum level71 level23 level94)
(sum level71 level25 level96)
(sum level72 level1 level73)
(sum level72 level3 level75)
(sum level72 level8 level80)
(sum level72 level10 level82)
(sum level72 level15 level87)
(sum level72 level17 level89)
(sum level72 level19 level91)
(sum level72 level23 level95)
(sum level72 level25 level97)
(sum level73 level1 level74)
(sum level73 level3 level76)
(sum level73 level8 level81)
(sum level73 level10 level83)
(sum level73 level15 level88)
(sum level73 level17 level90)
(sum level73 level19 level92)
(sum level73 level23 level96)
(sum level73 level25 level98)
(sum level74 level1 level75)
(sum level74 level3 level77)
(sum level74 level8 level82)
(sum level74 level10 level84)
(sum level74 level15 level89)
(sum level74 level17 level91)
(sum level74 level19 level93)
(sum level74 level23 level97)
(sum level74 level25 level99)
(sum level75 level1 level76)
(sum level75 level3 level78)
(sum level75 level8 level83)
(sum level75 level10 level85)
(sum level75 level15 level90)
(sum level75 level17 level92)
(sum level75 level19 level94)
(sum level75 level23 level98)
(sum level75 level25 level100)
(sum level76 level1 level77)
(sum level76 level3 level79)
(sum level76 level8 level84)
(sum level76 level10 level86)
(sum level76 level15 level91)
(sum level76 level17 level93)
(sum level76 level19 level95)
(sum level76 level23 level99)
(sum level76 level25 level101)
(sum level77 level1 level78)
(sum level77 level3 level80)
(sum level77 level8 level85)
(sum level77 level10 level87)
(sum level77 level15 level92)
(sum level77 level17 level94)
(sum level77 level19 level96)
(sum level77 level23 level100)
(sum level77 level25 level102)
(sum level78 level1 level79)
(sum level78 level3 level81)
(sum level78 level8 level86)
(sum level78 level10 level88)
(sum level78 level15 level93)
(sum level78 level17 level95)
(sum level78 level19 level97)
(sum level78 level23 level101)
(sum level78 level25 level103)
(sum level79 level1 level80)
(sum level79 level3 level82)
(sum level79 level8 level87)
(sum level79 level10 level89)
(sum level79 level15 level94)
(sum level79 level17 level96)
(sum level79 level19 level98)
(sum level79 level23 level102)
(sum level79 level25 level104)
(sum level80 level1 level81)
(sum level80 level3 level83)
(sum level80 level8 level88)
(sum level80 level10 level90)
(sum level80 level15 level95)
(sum level80 level17 level97)
(sum level80 level19 level99)
(sum level80 level23 level103)
(sum level80 level25 level105)
(sum level81 level1 level82)
(sum level81 level3 level84)
(sum level81 level8 level89)
(sum level81 level10 level91)
(sum level81 level15 level96)
(sum level81 level17 level98)
(sum level81 level19 level100)
(sum level81 level23 level104)
(sum level81 level25 level106)
(sum level82 level1 level83)
(sum level82 level3 level85)
(sum level82 level8 level90)
(sum level82 level10 level92)
(sum level82 level15 level97)
(sum level82 level17 level99)
(sum level82 level19 level101)
(sum level82 level23 level105)
(sum level82 level25 level107)
(sum level83 level1 level84)
(sum level83 level3 level86)
(sum level83 level8 level91)
(sum level83 level10 level93)
(sum level83 level15 level98)
(sum level83 level17 level100)
(sum level83 level19 level102)
(sum level83 level23 level106)
(sum level83 level25 level108)
(sum level84 level1 level85)
(sum level84 level3 level87)
(sum level84 level8 level92)
(sum level84 level10 level94)
(sum level84 level15 level99)
(sum level84 level17 level101)
(sum level84 level19 level103)
(sum level84 level23 level107)
(sum level84 level25 level109)
(sum level85 level1 level86)
(sum level85 level3 level88)
(sum level85 level8 level93)
(sum level85 level10 level95)
(sum level85 level15 level100)
(sum level85 level17 level102)
(sum level85 level19 level104)
(sum level85 level23 level108)
(sum level85 level25 level110)
(sum level86 level1 level87)
(sum level86 level3 level89)
(sum level86 level8 level94)
(sum level86 level10 level96)
(sum level86 level15 level101)
(sum level86 level17 level103)
(sum level86 level19 level105)
(sum level86 level23 level109)
(sum level86 level25 level111)
(sum level87 level1 level88)
(sum level87 level3 level90)
(sum level87 level8 level95)
(sum level87 level10 level97)
(sum level87 level15 level102)
(sum level87 level17 level104)
(sum level87 level19 level106)
(sum level87 level23 level110)
(sum level87 level25 level112)
(sum level88 level1 level89)
(sum level88 level3 level91)
(sum level88 level8 level96)
(sum level88 level10 level98)
(sum level88 level15 level103)
(sum level88 level17 level105)
(sum level88 level19 level107)
(sum level88 level23 level111)
(sum level88 level25 level113)
(sum level89 level1 level90)
(sum level89 level3 level92)
(sum level89 level8 level97)
(sum level89 level10 level99)
(sum level89 level15 level104)
(sum level89 level17 level106)
(sum level89 level19 level108)
(sum level89 level23 level112)
(sum level89 level25 level114)
(sum level90 level1 level91)
(sum level90 level3 level93)
(sum level90 level8 level98)
(sum level90 level10 level100)
(sum level90 level15 level105)
(sum level90 level17 level107)
(sum level90 level19 level109)
(sum level90 level23 level113)
(sum level90 level25 level115)
(sum level91 level1 level92)
(sum level91 level3 level94)
(sum level91 level8 level99)
(sum level91 level10 level101)
(sum level91 level15 level106)
(sum level91 level17 level108)
(sum level91 level19 level110)
(sum level91 level23 level114)
(sum level91 level25 level116)
(sum level92 level1 level93)
(sum level92 level3 level95)
(sum level92 level8 level100)
(sum level92 level10 level102)
(sum level92 level15 level107)
(sum level92 level17 level109)
(sum level92 level19 level111)
(sum level92 level23 level115)
(sum level92 level25 level117)
(sum level93 level1 level94)
(sum level93 level3 level96)
(sum level93 level8 level101)
(sum level93 level10 level103)
(sum level93 level15 level108)
(sum level93 level17 level110)
(sum level93 level19 level112)
(sum level93 level23 level116)
(sum level94 level1 level95)
(sum level94 level3 level97)
(sum level94 level8 level102)
(sum level94 level10 level104)
(sum level94 level15 level109)
(sum level94 level17 level111)
(sum level94 level19 level113)
(sum level94 level23 level117)
(sum level95 level1 level96)
(sum level95 level3 level98)
(sum level95 level8 level103)
(sum level95 level10 level105)
(sum level95 level15 level110)
(sum level95 level17 level112)
(sum level95 level19 level114)
(sum level96 level1 level97)
(sum level96 level3 level99)
(sum level96 level8 level104)
(sum level96 level10 level106)
(sum level96 level15 level111)
(sum level96 level17 level113)
(sum level96 level19 level115)
(sum level97 level1 level98)
(sum level97 level3 level100)
(sum level97 level8 level105)
(sum level97 level10 level107)
(sum level97 level15 level112)
(sum level97 level17 level114)
(sum level97 level19 level116)
(sum level98 level1 level99)
(sum level98 level3 level101)
(sum level98 level8 level106)
(sum level98 level10 level108)
(sum level98 level15 level113)
(sum level98 level17 level115)
(sum level98 level19 level117)
(sum level99 level1 level100)
(sum level99 level3 level102)
(sum level99 level8 level107)
(sum level99 level10 level109)
(sum level99 level15 level114)
(sum level99 level17 level116)
(sum level100 level1 level101)
(sum level100 level3 level103)
(sum level100 level8 level108)
(sum level100 level10 level110)
(sum level100 level15 level115)
(sum level100 level17 level117)
(sum level101 level1 level102)
(sum level101 level3 level104)
(sum level101 level8 level109)
(sum level101 level10 level111)
(sum level101 level15 level116)
(sum level102 level1 level103)
(sum level102 level3 level105)
(sum level102 level8 level110)
(sum level102 level10 level112)
(sum level102 level15 level117)
(sum level103 level1 level104)
(sum level103 level3 level106)
(sum level103 level8 level111)
(sum level103 level10 level113)
(sum level104 level1 level105)
(sum level104 level3 level107)
(sum level104 level8 level112)
(sum level104 level10 level114)
(sum level105 level1 level106)
(sum level105 level3 level108)
(sum level105 level8 level113)
(sum level105 level10 level115)
(sum level106 level1 level107)
(sum level106 level3 level109)
(sum level106 level8 level114)
(sum level106 level10 level116)
(sum level107 level1 level108)
(sum level107 level3 level110)
(sum level107 level8 level115)
(sum level107 level10 level117)
(sum level108 level1 level109)
(sum level108 level3 level111)
(sum level108 level8 level116)
(sum level109 level1 level110)
(sum level109 level3 level112)
(sum level109 level8 level117)
(sum level110 level1 level111)
(sum level110 level3 level113)
(sum level111 level1 level112)
(sum level111 level3 level114)
(sum level112 level1 level113)
(sum level112 level3 level115)
(sum level113 level1 level114)
(sum level113 level3 level116)
(sum level114 level1 level115)
(sum level114 level3 level117)
(sum level115 level1 level116)
(sum level116 level1 level117)

(connected l0 l2)
(fuelcost level25 l0 l2)
(connected l0 l3)
(fuelcost level10 l0 l3)
(connected l0 l5)
(fuelcost level23 l0 l5)
(connected l1 l4)
(fuelcost level8 l1 l4)
(connected l1 l5)
(fuelcost level19 l1 l5)
(connected l2 l0)
(fuelcost level25 l2 l0)
(connected l2 l5)
(fuelcost level1 l2 l5)
(connected l2 l6)
(fuelcost level25 l2 l6)
(connected l3 l0)
(fuelcost level10 l3 l0)
(connected l3 l6)
(fuelcost level3 l3 l6)
(connected l4 l1)
(fuelcost level8 l4 l1)
(connected l4 l5)
(fuelcost level15 l4 l5)
(connected l4 l6)
(fuelcost level17 l4 l6)
(connected l5 l0)
(fuelcost level23 l5 l0)
(connected l5 l1)
(fuelcost level19 l5 l1)
(connected l5 l2)
(fuelcost level1 l5 l2)
(connected l5 l4)
(fuelcost level15 l5 l4)
(connected l6 l2)
(fuelcost level25 l6 l2)
(connected l6 l3)
(fuelcost level3 l6 l3)
(connected l6 l4)
(fuelcost level17 l6 l4)

(at t0 l1)
(fuel t0 level117)
(= (total-cost) 0)

(at p0 l6)
(at p1 l2)
(at p2 l5)
)

(:goal
(and
(at p0 l0)
(at p1 l0)
(at p2 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l5 level98 level19 level117)
   deleted: (at t0 l1) (fuel t0 level117)
   added: (at t0 l5) (fuel t0 level98)
   goals met: 0 of 3
2. (load p2 t0 l5)
   deleted: (at p2 l5)
   added: (in p2 t0)
   goals met: 0 of 3
3. (drive t0 l5 l1 level79 level19 level98)
   deleted: (at t0 l5) (fuel t0 level98)
   added: (at t0 l1) (fuel t0 level79)
   goals met: 0 of 3
4. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 1 of 3
5. (drive t0 l1 l4 level71 level8 level79)
   deleted: (at t0 l1) (fuel t0 level79)
   added: (at t0 l4) (fuel t0 level71)
   goals met: 1 of 3
6. (drive t0 l4 l6 level54 level17 level71)
   deleted: (at t0 l4) (fuel t0 level71)
   added: (at t0 l6) (fuel t0 level54)
   goals met: 1 of 3
7. (load p0 t0 l6)
   deleted: (at p0 l6)
   added: (in p0 t0)
   goals met: 1 of 3
8. (drive t0 l6 l2 level29 level25 level54)
   deleted: (at t0 l6) (fuel t0 level54)
   added: (at t0 l2) (fuel t0 level29)
   goals met: 1 of 3
9. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 1 of 3
10. (drive t0 l2 l0 level4 level25 level29)
   deleted: (at t0 l2) (fuel t0 level29)
   added: (at t0 l0) (fuel t0 level4)
   goals met: 1 of 3
11. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 2 of 3
12. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 3 of 3
